Repository: 7kfpun/SwiftUI-TWAQI
Catalog: TWAQI/Localization/*.lproj/Localizable.strings
Languages: th, zh_hans, zh_hant

# Tabbar.main
source: Main
th: แผนที่
zh_hans: 首页
zh_hant: 首頁

# Tabbar.favourites
source: Favourites
th: สถานีโปรด
zh_hans: 最爱
zh_hant: 最愛

# Tabbar.details_list
source: Search
th: สถานี
zh_hans: 搜索
zh_hant: 搜索

# Tabbar.forecast
source: Forecast
th: พยากรณ์
zh_hans: 预报
zh_hant: 預報

# Tabbar.settings
source: Settings
th: การตั้งค่า
zh_hans: 通知
zh_hant: 通知

# Tabbar.help
source: Help
th: ช่วยเหลือ
zh_hans: 帮助
zh_hant: 幫助

# FavouriteList.favourites
source: Favourites
th: สถานีโปรด
zh_hans: 最爱列表
zh_hant: 最愛列表

# Favourites.add_your_first_favourite_station
source: Add your first favourite station
th: เพิ่มสถานีแรกที่คุณชื่นชอบ
zh_hans: 添加您的最爱
zh_hant: 添加您的最愛

# Favourites.remove_all_your_saved_stations
source: Remove all your saved station
th: ลบสถานีที่บันทึกไว้ทั้งหมด
zh_hans: 删除所有最爱
zh_hant: 刪除所有最愛

# DetailsList.details
source: Details
th: รายละเอียด
zh_hans: 空气品质详情
zh_hant: 空氣品質詳情

# DetailsList.search
source: Search
th: ค้นหา
zh_hans: 搜索
zh_hant: 搜索

# Details.general_public
source: General public
th: ประชาชนทั่วไป
zh_hans: 一般族群
zh_hant: 一般族群

# Details.sensitive_group
source: Sensitive group
th: กลุ่มที่ละเอียดอ่อน
zh_hans: 敏感族群
zh_hant: 敏感族群

# Forecast.forecast
source: Forecast
th: พยากรณ์
zh_hans: 空气品质预报
zh_hant: 空氣品質預報

# Forecast.forecast_notification_daily
source: Forecast Notification (daily)
th: การแจ้งเตือนการพยากรณ์ (รายวัน)
zh_hans: 空气品质预报通知（每日）
zh_hant: 空氣品質預報通知（每日）

# Forecast.publish_time
source: Publish Time
th: เวลาเผยแพร่
zh_hans: 发布时间
zh_hant: 發布時間

# Forecast.three_days_forecast
source: 3 Days
th: 3 วัน
zh_hans: 3 天预测
zh_hant: 3 天預測

# Forecast.details_forecast
source: Details
th: รายละเอียด
zh_hans: 详细预测
zh_hant: 詳細預測

# Settings.notification
source: Notification
th: การแจ้งเตือน
zh_hans: 空气品质通知
zh_hant: 空氣品質通知

# Settings.search
source: Search
th: ค้นหา
zh_hans: 搜索
zh_hant: 搜索

# Settings.notice_me_when_aqi_is_above
source: Notice me when AQI is above
th: แจ้งให้ฉันทราบเมื่อ AQI อยู่เหนือ
zh_hans: 当空气品质明显恶化时，请通知我
zh_hant: 當空氣品質明顯惡化時，請通知我

# Settings.the_value_is_too_small_you_would_get_lots_of_notifications
source: The value is too small, you would get lots of notifications
th: ค่าน้อยเกินไปคุณจะได้รับการแจ้งเตือนมากมาย
zh_hans: 您所设定的值偏低，将会收到很多通知哦
zh_hant: 您所設定的值偏低，將會收到很多通知哦

# Settings.notice_me_when_aqi_is_below
source: Notice me when AQI is below
th: แจ้งให้ฉันทราบเมื่อ AQI อยู่ด้านล่าง
zh_hans: 当空气品质优良时，请通知我
zh_hant: 當空氣品質優良時，請通知我

# Settings.the_value_is_too_large_you_would_get_lots_of_notifications
source: The value is too large, you would get lots of notifications
th: ค่ามีขนาดใหญ่เกินไปคุณจะได้รับการแจ้งเตือนจำนวนมาก
zh_hans: 您所设定的值偏高，将会收到很多通知哦
zh_hant: 您所設定的值偏高，將會收到很多通知哦

# Settings.you_can_only_enable_at_most_for_two_stations
source: You can only enable at most for 2 stations
th: คุณสามารถเปิดใช้งานได้ไม่เกิน 2 สถานีเท่านั้น
zh_hans: 最多只能启用 2 个地点
zh_hant: 最多只能啟用 2 個地點

# Help.help
source: Help
th: ช่วยเหลือ
zh_hans: 帮助
zh_hant: 幫助

# Help.do_not_disturb
source: Do Not Disturb
th: ห้ามรบกวน
zh_hans: 请勿打扰
zh_hant: 請勿打擾

# Help.turn_on_do_not_disturb
source: Turn on Do Not Disturb
th: เปิดใช้ห้ามรบกวน
zh_hans: 开启请勿打扰
zh_hant: 開啟請勿打擾

# Help.start_time
source: Start Time
th: เวลาเริ่มต้น
zh_hans: 开始
zh_hant: 開始

# Help.end_time
source: End Time
th: เวลาสิ้นสุด
zh_hans: 结束
zh_hant: 結束

# Help.cancel_site_notification
source: Cancel site notification
th: ยกเลิกการแจ้งเตือน
zh_hans: 取消所有空气品质通知
zh_hant: 取消所有空氣品質通知

# Help.all_site_notification_has_been_cancelled
source: All site notification has been cancelled
th: การแจ้งเตือนทั้งหมดถูกยกเลิก
zh_hans: 已经取消所有通知
zh_hant: 已經取消所有通知

# Help.in_app_purchase
source: In-app purchase
th: การซื้อในแอป
zh_hans: 应用程式内购买
zh_hant: 應用程式內購買

# Help.ad_free
source: Remove Ads?
th: ลบโฆษณาหรือไม่
zh_hans: 想移除广告？
zh_hant: 想移除廣告？

# Help.restore_purchase
source: Restore purchase
th: คืนค่าการซื้อ
zh_hans: 恢复你的应用内购买
zh_hant: 恢復你的應用內購買

# Help.contact_us
source: Contact us
th: ติดต่อเรา
zh_hans: 联络我们
zh_hant: 聯絡我們

# Help.interested_to_be_our_business_partner
source: Interested to be our Business Partner?
th: สนใจที่จะเป็นพันธมิตรทางธุรกิจของเราหรือไม่
zh_hans: 想成为我们合作伙伴吗？
zh_hant: 想成為我們合作夥伴嗎？

# Help.feedback_or_contact_us
source: Feedback / Contact us
th: ข้อเสนอแนะ / ติดต่อเรา
zh_hans: 反馈 / 联络我们
zh_hant: 反饋 / 聯絡我們

# Help.definition
source: Terms
th: คำอธิบายศัพท์
zh_hans: 帮助
zh_hant: 幫助

# Help.data_provided_by_government
source: The data is provided by the Environmental Protection Administration, Executive Yuan, R.O.C. (Taiwan)
zh_hans: 台湾空污即时预报所有数据皆由「行政院环境保护署－空气品质监测网」(Open Data) 提供。
zh_hant: 台灣空污即時預報所有數據皆由「行政院環境保護署－空氣品質監測網」(Open Data) 提供。

# AirIndex.meaning_aqi
source: Air quality index
th: คุณภาพอากาศ (AQI)
zh_hans: 空气品质指数
zh_hant: 空氣品質指數

# AirIndex.meaning_pm25
source: Particulates (PM2.5)
th: ฝุ่นละออง (PM2.5)
zh_hans: 细悬浮微粒
zh_hant: 細懸浮微粒

# AirIndex.meaning_pm10
source: Particulates (PM10)
th: ฝุ่นละออง (PM10)
zh_hans: 悬浮微粒
zh_hant: 懸浮微粒

# AirIndex.meaning_o3
source: Ozone
th: โอโซน
zh_hans: 臭氧
zh_hant: 臭氧

# AirIndex.meaning_co
source: Carbon monoxide
th: คาร์บอนมอนอกไซด์
zh_hans: 一氧化碳
zh_hant: 一氧化碳

# AirIndex.meaning_so2
source: Sulfur dioxide
th: ซัลเฟอร์ไดออกไซด์
zh_hans: 二氧化硫
zh_hant: 二氧化硫

# AirIndex.meaning_no2
source: Nitrogen dioxide
th: ไนโตรเจนไดออกไซด์
zh_hans: 二氧化氮
zh_hant: 二氧化氮

# AirIndex.description_aqi
source: Air quality index
th: คุณภาพอากาศ (AQI)
zh_hans: 综合各项污染的空气指标，数值愈高，空气愈脏
zh_hant: 綜合各項污染的空氣指標，數值愈高，空氣愈髒

# AirIndex.description_pm25
source: Particulates (PM2.5)
th: ฝุ่นละออง (PM2.5)
zh_hans: 对心血管、神经系统伤害大，可能含有重金属等重度污染物
zh_hant: 對心血管、神經系統傷害大，可能含有重金屬等重度污染物

# AirIndex.description_pm10
source: Particulates (PM10)
th: ฝุ่นละออง (PM10)
zh_hans: 颗粒较大的悬浮微粒，过量可形成雾霾
zh_hant: 顆粒較大的懸浮微粒，過量可形成霧霾

# AirIndex.description_o3
source: Ozone
th: โอโซน
zh_hans: 对眼睛、呼吸道等有侵蚀和损害作用
zh_hant: 對眼睛、呼吸道等有侵蝕和損害作用

# AirIndex.description_co
source: Carbon monoxide
th: คาร์บอนมอนอกไซด์
zh_hans: 主要由燃烧化石燃料或火山爆发产生，通常在大气少量存在
zh_hant: 主要由燃燒化石燃料或火山爆發產生，通常在大氣少量存在

# AirIndex.description_so2
source: Sulfur dioxide
th: ซัลเฟอร์ไดออกไซด์
zh_hans: 过量接触将有眼睛疼痛、肺部伤害
zh_hant: 過量接觸將有眼睛疼痛、肺部傷害

# AirIndex.description_no2
source: Nitrogen dioxide
th: ไนโตรเจนไดออกไซด์
zh_hans: 来自于车辆废气、火力发电厂或其他工业染料，过量吸收伤害肺部
zh_hant: 來自於車輛廢氣、火力發電廠或其他工業染料，過量吸收傷害肺部

# AirIndex.url_aqi
source: https://en.wikipedia.org/wiki/Air_quality_index
zh_hans: https://zh.wikipedia.org/wiki/%E7%A9%BA%E6%B0%94%E8%B4%A8%E9%87%8F%E6%8C%87% E6%95%B0
zh_hant: https://zh.wikipedia.org/wiki/%E7%A9%BA%E6%B0%94%E8%B4%A8%E9%87%8F%E6%8C%87%E6%95%B0

# AirIndex.url_pm25
source: https://en.wikipedia.org/wiki/Particulates
zh_hans: https://zh.wikipedia.org/wiki/%E6%87%B8%E6%B5%AE%E7%B2%92%E5%AD%90
zh_hant: https://zh.wikipedia.org/wiki/%E6%87%B8%E6%B5%AE%E7%B2%92%E5%AD%90

# AirIndex.url_pm10
source: https://en.wikipedia.org/wiki/Particulates
zh_hans: https://zh.wikipedia.org/wiki/%E6%87%B8%E6%B5%AE%E7%B2%92%E5%AD%90
zh_hant: https://zh.wikipedia.org/wiki/%E6%87%B8%E6%B5%AE%E7%B2%92%E5%AD%90

# AirIndex.url_o3
source: https://en.wikipedia.org/wiki/Ozone
zh_hans: https://zh.wikipedia.org/wiki/%E8%87%AD%E6%B0%A7
zh_hant: https://zh.wikipedia.org/wiki/%E8%87%AD%E6%B0%A7

# AirIndex.url_co
source: https://en.wikipedia.org/wiki/Carbon_monoxide
zh_hans: https://zh.wikipedia.org/wiki/%E4%B8%80%E6%B0%A7%E5%8C%96%E7%A2%B3
zh_hant: https://zh.wikipedia.org/wiki/%E4%B8%80%E6%B0%A7%E5%8C%96%E7%A2%B3

# AirStatus.good
source: Good
th: ดี
zh_hans: 良好
zh_hant: 良好

# AirStatus.moderate
source: Moderate
th: ปานกลาง
zh_hans: 普通
zh_hant: 普通

# AirStatus.unhealthyforsensitivegroup
source: Unhealthy for sensitive groups
th: มีผลกระทบต่อกลุ่มที่มีความอ่อนไหว
zh_hans: 对敏感族群不良
zh_hant: 對敏感族群不良

# AirStatus.unhealthy
source: Unhealthy
th: มีผลกระทบต่อสุขภาพ
zh_hans: 对所有族群不良
zh_hant: 對所有族群不良

# AirStatus.veryunhealthy
source: Very unhealthy
th: มีผบกระทบต่อสุขภาพมาก
zh_hans: 非常不良
zh_hant: 非常不良

# AirStatus.hazardous
source: Hazardous
th: อันตราย
zh_hans: 有害
zh_hant: 有害

# AirStatus.general_public_guidance_good
source: Enjoy your usual outdoor activities
th: คุณภาพอากาศดีมาก เหมาะสำหรับกิจกรรมกลางแจ้งและการท่องเที่ยว
zh_hans: 正常户外活动
zh_hant: 正常戶外活動

# AirStatus.general_public_guidance_moderate
source: Enjoy your usual outdoor activities
th: สามารถทำกิจกรรมกลางแจ้งได้ตามปกติ
zh_hans: 正常户外活动
zh_hant: 正常戶外活動

# AirStatus.general_public_guidance_unhealthyforsensitivegroup
source: Consider reducing outdoor activities
th: ควรเฝ้าระวังสุขภาพ ถ้ามีอาการเบื้องต้น เช่น ไอ หายใจลำบาก ระคายเคืองตา ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น
zh_hans: 考虑减少户外活动
zh_hant: 考慮減少戶外活動

# AirStatus.general_public_guidance_unhealthy
source: Should reduce physical exertion, particularly outdoors
th: ควรเฝ้าระวังสุขภาพ ถ้ามีอาการเบื้องต้น เช่น ไอ หายใจลำบาก ระคายเคืองตา ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น
zh_hans: 减少体力消耗，特别是减少户外活动
zh_hant: 減少體力消耗，特別是減少戶外活動

# AirStatus.general_public_guidance_veryunhealthy
source: Reduce outdoor activities
th: ทุกคนควรหลีกเลี่ยงกิจกรรมกลางแจ้งหลีกเลี่ยงพื้นที่ที่มีมลพิษทางอากาศสูง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น หากมีอาการทางสุขภาพควรปรึกษาแพทย์
zh_hans: 减少户外活动
zh_hant: 減少戶外活動

# AirStatus.general_public_guidance_hazardous
source: Avoid outdoor activities and keep doors and windows closed
th: ทุกคนควรหลีกเลี่ยงกิจกรรมกลางแจ้งหลีกเลี่ยงพื้นที่ที่มีมลพิษทางอากาศสูง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น หากมีอาการทางสุขภาพควรปรึกษาแพทย์
zh_hans: 避免户外活动
zh_hant: 避免戶外活動

# AirStatus.sensitive_group_guidance_good
source: Enjoy your usual outdoor activities
th: คุณภาพอากาศดีมาก เหมาะสำหรับกิจกรรมกลางแจ้งและการท่องเที่ยว
zh_hans: 正常户外活动
zh_hant: 正常戶外活動

# AirStatus.sensitive_group_guidance_moderate
source: Can still be active outside
th: หากมีอาการเบื้องต้น เช่น ไอ หายใจลำบาก ระคายเคืองตา ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง
zh_hans: 仍可正常户外活动
zh_hant: 仍可正常戶外活動

# AirStatus.sensitive_group_guidance_unhealthyforsensitivegroup
source: Reduce physical exertion and outdoor activities
th: ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น ถ้ามีอาการทางสุขภาพ เช่น ไอ หายใจลำบาก ตาอักเสบ แน่นหน้าอก ปวดศีรษะ หัวใจเต้นไม่เป็นปกติ คลื่นไส้ อ่อนเพลีย ควรปรึกษาแพทย์
zh_hans: 减少体力消耗活动及户外活动
zh_hant: 減少體力消耗活動及戶外活動

# AirStatus.sensitive_group_guidance_unhealthy
source: Stay indoors and reduce physical exertion
th: ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น ถ้ามีอาการทางสุขภาพ เช่น ไอ หายใจลำบาก ตาอักเสบ แน่นหน้าอก ปวดศีรษะ หัวใจเต้นไม่เป็นปกติ คลื่นไส้ อ่อนเพลีย ควรปรึกษาแพทย์
zh_hans: 留在室内并减少体力消耗活动
zh_hant: 留在室內並減少體力消耗活動

# AirStatus.sensitive_group_guidance_veryunhealthy
source: Stay indoors and reduce physical exertion
th: ทุกคนควรหลีกเลี่ยงกิจกรรมกลางแจ้งหลีกเลี่ยงพื้นที่ที่มีมลพิษทางอากาศสูง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น หากมีอาการทางสุขภาพควรปรึกษาแพทย์
zh_hans: 留在室内并减少体力消耗活动
zh_hant: 留在室內並減少體力消耗活動

# AirStatus.sensitive_group_guidance_hazardous
source: Stay indoors and avoid physical exertion
th: ทุกคนควรหลีกเลี่ยงกิจกรรมกลางแจ้งหลีกเลี่ยงพื้นที่ที่มีมลพิษทางอากาศสูง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น หากมีอาการทางสุขภาพควรปรึกษาแพทย์
zh_hans: 留在室内并避免体力消耗活动
zh_hant: 留在室內並避免體力消耗活動

# AreaGroup.north
source: North
zh_hans: 北部
zh_hant: 北部

# AreaGroup.chumiao
source: Chu-Miao
zh_hans: 竹苗
zh_hant: 竹苗

# AreaGroup.central
source: Central
zh_hans: 中部
zh_hant: 中部

# AreaGroup.yunchianan
source: Yun-Chia-Nan
zh_hans: 云嘉南
zh_hant: 雲嘉南

# AreaGroup.kaoping
source: KaoPing
zh_hans: 高屏
zh_hant: 高屏

# AreaGroup.yilan
source: Yilan
zh_hans: 宜兰
zh_hant: 宜蘭

# AreaGroup.huatun
source: Hua-Tun
zh_hans: 花东
zh_hant: 花東

# AreaGroup.matsu
source: Matsu
zh_hans: 马祖
zh_hant: 馬祖

# AreaGroup.kinmen
source: Kinmen
zh_hans: 金门
zh_hant: 金門

# AreaGroup.magong
source: Magong
zh_hans: 澎湖
zh_hant: 澎湖
